return {
	help=
	{
		[1]=
		{
			id = 1,
			info = "抢红包：",
		},
		[2]=
		{
			id = 2,
			info = "1、每个红包都有个雷号，抢到红包数额的尾号和雷号一致就踩雷；",
		},
		[3]=
		{
			id = 3,
			info = "2、踩雷后自己扣除该红包总额的鲸币，扣除的鲸币存入聚宝盆；",
		},
		[4]=
		{
			id = 4,
			info = "3、但玩家踩雷后，系统会自动发送该红包总额的鲸币给发红包玩家。\n",
		},
		[5]=
		{
			id = 5,
			info = "发红包：",
		},
		[6]=
		{
			id = 6,
			info = "1、发的红包额度不能超过自身携带的鲸币；",
		},
		[7]=
		{
			id = 7,
			info = "2、可自己设定发红包的雷号；",
		},
		[8]=
		{
			id = 8,
			info = "3、如果有人抢红包踩雷，那么发红包的人就可以获得系统奖励的红包总额；",
		},
		[9]=
		{
			id = 9,
			info = "4、如果一个红包中了多个雷，那么发红包的人可以获得系统发的多份红包总额奖励；",
		},
		[10]=
		{
			id = 10,
			info = "5、发的红包如果在2分钟没有被抢完，那么剩余未被抢的金额将回退给发红包的人；",
		},
		[11]=
		{
			id = 11,
			info = "6、每个人最多发2个未被抢完的红包，红包被抢完后可继续发红包。\n",
		},
		[12]=
		{
			id = 12,
			info = "招财进宝场：",
		},
		[13]=
		{
			id = 13,
			info = "1、招财进宝场次每天有3次抢红包的机会，24:00重置次数；",
		},
		[14]=
		{
			id = 14,
			info = "2、招财进宝场次中如果踩雷那么将扣除1次抢红包机会；",
		},
		[15]=
		{
			id = 15,
			info = "3、招财进宝场次中不能发红包。\n",
		},
	},
}