return {
	fishingmatch_config=
	{
		[1]=
		{
			line = 1,
			id = 1,
			desc = "副炮捕获的鱼只会获得赢分",
		},
		[2]=
		{
			line = 2,
			id = 2,
			desc = "将自己的积分尽可能多地转换为赢分，就是获得好名次的关键",
		},
		[3]=
		{
			line = 3,
			id = 3,
			desc = "在副炮免费解锁前，可以通过消耗积分提前解锁",
		},
		[4]=
		{
			line = 4,
			id = 4,
			desc = "超级原子弹、雷电风暴威力巨大，但只能获得赢分",
		},
		[5]=
		{
			line = 5,
			id = 5,
			desc = "捕获宝箱后可以获得好运道具，还会有各种作用于其它玩家的效果哦！",
		},
		[6]=
		{
			line = 6,
			id = 6,
			desc = "乌贼极难捕获，价值也很低，最好避开它们",
		},
		[7]=
		{
			line = 7,
			id = 7,
			desc = "捕获海星可以获得大量赢分奖励",
		},
		[8]=
		{
			line = 8,
			id = 8,
			desc = "如果积分储备非常充足，就尽快解锁副炮、多多购买道具吧！",
		},
	},
}