return {
	base=
	{
		[1]=
		{
			id = 1,
			task = 21565,
			total = 30000,
			task_name = "小游戏累计赢金3万",
			show_hb = 5,
			hb = {1,3,5},
		},
		[2]=
		{
			id = 2,
			task = 21565,
			total = 100000,
			task_name = "小游戏累计赢金10万",
			show_hb = 10,
			hb = {5,8,10},
		},
		[3]=
		{
			id = 3,
			task = 21565,
			total = 500000,
			task_name = "小游戏累计赢金50万",
			show_hb = 50,
			hb = {30,40,50},
		},
		[4]=
		{
			id = 4,
			task = 21565,
			total = 1000000,
			task_name = "小游戏累计赢金100万",
			show_hb = 100,
			hb = {50,80,100},
		},
		[5]=
		{
			id = 5,
			task = 21565,
			total = 2000000,
			task_name = "小游戏累计赢金200万",
			show_hb = 200,
			hb = {150,180,200},
		},
		[6]=
		{
			id = 6,
			task = 21565,
			total = 5000000,
			task_name = "小游戏累计赢金500万",
			show_hb = 500,
			hb = {300,400,500},
		},
		[7]=
		{
			id = 7,
			task = 21565,
			total = 10000000,
			task_name = "小游戏累计赢金1000万",
			show_hb = 1000,
			hb = {800,900,1000},
		},
		[8]=
		{
			id = 8,
			task = 21565,
			total = 50000000,
			task_name = "小游戏累计赢金5000万",
			show_hb = 5000,
			hb = {4500,4800,5000},
		},
		[9]=
		{
			id = 9,
			task = 21565,
			total = 100000000,
			task_name = "小游戏累计赢金1亿",
			show_hb = 10000,
			hb = {8000,9000,10000},
		},
		[10]=
		{
			id = 10,
			task = 21565,
			total = 200000000,
			task_name = "小游戏累计赢金2亿",
			show_hb = 20000,
			hb = {15000,18000,20000},
		},
	},
	helpinfo=
	{
		[1]=
		{
			index = 1,
			text = "1. 活动时间：10月29日7:30 — 11月4日23:59:59；",
			button_image = "activity_bg_pic16_1",
		},
		[2]=
		{
			index = 2,
			text = "2. 活动期间，在充值商城中累计充值达到指定的金额可获得对应的奖励；",
		},
		[3]=
		{
			index = 3,
			text = "3.活动结束后未领取的奖励视为自动放弃;",
		},
		[4]=
		{
			index = 4,
			text = "4.实物奖励，请在11月10日前联系客服QQ：4008882620领取，否则视为自动放弃奖励；",
		},
		[5]=
		{
			index = 5,
			text = "5.实物奖励将在活动结束后7天内统一发放。",
		},
	},
}