return {
	question=
	{
		[1]=
		{
			id = 1,
			ask = "暗访山东（打2字地名）",
			answer = 3,
			option = {"中国","山东","秘鲁","烟台"},
		},
		[2]=
		{
			id = 2,
			ask = "犹如丫丫翻了身（打一字）",
			answer = 2,
			option = {"众","从","多","徐"},
		},
		[3]=
		{
			id = 3,
			ask = "上下一体（打一字）",
			answer = 3,
			option = {"忐","忑","卡","元"},
		},
		[4]=
		{
			id = 4,
			ask = "丰收(打一字)",
			answer = 2,
			option = {"多","移","种","田"},
		},
		[5]=
		{
			id = 5,
			ask = "生日正好逢新年 (打一字)",
			answer = 1,
			option = {"醒","薪","胜","晶"},
		},
		[6]=
		{
			id = 6,
			ask = "四个晚上(打一字)",
			answer = 3,
			option = {"晚","早","罗","惜"},
		},
		[7]=
		{
			id = 7,
			ask = "这声音来自钱塘江 （打一字）",
			answer = 2,
			option = {"糖","浙", "溏","哲"},
		},
		[8]=
		{
			id = 8,
			ask = "元宵月光窗前洒 （打一字）",
			answer = 1,
			option = {"一","肖","西","洒"},
		},
		[9]=
		{
			id = 9,
			ask = "内里有人(打一字)",
			answer = 2,
			option = {"并","肉","丙","两"},
		},
		[10]=
		{
			id = 10,
			ask = "入门无犬吠(打一字)",
			answer = 2,
			option = {"闻","问","儒","券"},
		},
	},
}