return {
	level=
	{
		[1]=
		{
			id = 1,
			title = "推广小兵",
			need = 5,
			award_name = {"1000金币",},
			award_img = {"practice_icon_jinbi",},
		},
		[2]=
		{
			id = 2,
			title = "推广上等兵",
			need = 35,
			award_name = {"6.88福卡",},
			award_img = {"bbsc_icon_hb",},
		},
		[3]=
		{
			id = 3,
			title = "推广下士",
			need = 95,
			award_name = {"18.88福卡",},
			award_img = {"bbsc_icon_hb",},
		},
		[4]=
		{
			id = 4,
			title = "推广中士",
			need = 180,
			award_name = {"38.88福卡","独角兽手机支架",},
			award_img = {"bbsc_icon_hb","activity_icon_gift41"},
		},
		[5]=
		{
			id = 5,
			title = "推广上士",
			need = 420,
			award_name = {"88.88福卡","卡通漱口杯1套",},
			award_img = {"bbsc_icon_hb","activity_icon_gift43"},
		},
	},
	question=
	{
		[1]=
		{
			id = 1,
			ask = "推广员的特权奖项中没有以下哪一个？",
			answer = 3,
			option = {"玩家奖","比赛奖","好友奖","礼包奖"},
			score = 12.500000,
		},
		[2]=
		{
			id = 2,
			ask = "99元全返礼包中赠送几张千元赛门票？",
			answer = 4,
			option = {"1张","3张","5张","10张"},
			score = 12.500000,
		},
		[3]=
		{
			id = 3,
			ask = "99元全返礼包怎么返？",
			answer = 1,
			option = {"参与10场千元赛无论输赢返100元福卡","返鲸币","返鱼币","返钻石"},
			score = 12.500000,
		},
		[4]=
		{
			id = 4,
			ask = "以下哪一天不举办千元赛？",
			answer = 4,
			option = {"周二","周四","周六","周日"},
			score = 12.500000,
		},
		[5]=
		{
			id = 5,
			ask = "开通礼包奖后，好友购买金猪礼包1，自己可获得多少奖励？",
			answer = 4,
			option = {"没有奖励","20元","30元","50元"},
			score = 12.500000,
		},
		[6]=
		{
			id = 6,
			ask = "福卡不能用来做什么？",
			answer = 3,
			option = {"换家用电器", "换金币","换月卡","换话费"},
			score = 12.500000,
		},
		[7]=
		{
			id = 7,
			ask = "玩家奖中对有效好友的定义是什么？",
			answer = 1,
			option = {"完成新人福卡第2天的任务","扫码好友", "登陆好友","充值好友"},
			score = 12.500000,
		},
		[8]=
		{
			id = 8,
			ask = "开通比赛奖后，好友首次参与千元赛取得多少名自己可获得推广奖励？",
			answer = 4,
			option = {"前3名","前10名","前96名","任意名次，打完就有"},
			score = 12.500000,
		},
		[9]=
		{
			id = 9,
			ask = "开通礼包奖后，好友购买以下哪个礼包没有奖励？",
			answer = 3,
			option = {"金猪礼包1","金猪礼包2","财神礼包","全返礼包"},
			score = 12.500000,
		},
		[10]=
		{
			id = 10,
			ask = "开通推广权限应该加哪个客服微信？",
			answer = 2,
			option = {"鲸小弟","鲸小哥","鲸大哥","鲸老哥"},
			score = 12.500000,
		},
		[11]=
		{
			id = 11,
			ask = "好友人数达10人升级高级权限可获得多少鲸币奖励？",
			answer = 1,
			option = {"66666鲸币","6666鲸币","8888鲸币","2888鲸币"},
			score = 12.500000,
		},
		[12]=
		{
			id = 12,
			ask = "在哪里查看自己邀请的好友名单？",
			answer = 1,
			option = {"推广系统【我的收益】页面","匹配场","邮件","活动栏"},
			score = 12.500000,
		},
		[13]=
		{
			id = 13,
			ask = "全返礼包在哪里购买？",
			answer = 1,
			option = {"推广系统【全返礼包】页面","充值商城","兑换商城","大厅"},
			score = 12.500000,
		},
		[14]=
		{
			id = 14,
			ask = "推广获得的收益在哪里查看？",
			answer = 1,
			option = {"推广系统【我的收益】页面","商城","邮件","活动栏"},
			score = 12.500000,
		},
		[15]=
		{
			id = 15,
			ask = "在推广系统【我的收益】页面中的灰色奖励图标表示什么？",
			answer = 1,
			option = {"好友未贡献此奖励","好友未登陆","好友未下载","好友未充值"},
			score = 12.500000,
		},
		[16]=
		{
			id = 16,
			ask = "推广收益每日最多可提取多少元？",
			answer = 4,
			option = {"5元","50元","100元","200元"},
			score = 12.500000,
		},
		[17]=
		{
			id = 17,
			ask = "推广员在哪里查看详细的奖励规则？",
			answer = 1,
			option = {"推广系统【如何赚钱】页面","比赛奖","好友奖","礼包奖"},
			score = 12.500000,
		},
		[18]=
		{
			id = 18,
			ask = "如何跟好友绑定上下级关系？",
			answer = 1,
			option = {"从游戏里分享图片或链接到微信，好友打开下载后绑定关系","面对面扫码","登录好友的账号","找客服绑定"},
			score = 12.500000,
		},
		[19]=
		{
			id = 19,
			ask = "以下哪一个推广权限是默认开通的？",
			answer = 1,
			option = {"玩家奖","比赛奖","礼包奖","高级权限"},
			score = 12.500000,
		},
		[20]=
		{
			id = 20,
			ask = "好友人数达到几人，可联系鲸小哥升级高级权限，领取66666鲸币福利？",
			answer = 2,
			option = {"5人","10人","20人","30人"},
			score = 12.500000,
		},
	},
	set=
	{
		[1]=
		{
			id  = 1,
			info = "档次1",
			set = {0,50},
			text = "很遗憾离满分还有一点距离，再接再厉吧！",
		},
		[2]=
		{
			id  = 2,
			info = "档次2",
			set = {50,99},
			text = "看到胜利的曙光啦，还差%s分就能获得成就奖励，再试一次吧！",
		},
		[3]=
		{
			id  = 3,
			info = "档次3",
			set = {99,100},
			text = "恭喜您获得满分！已增加10成就点！",
		},
		[4]=
		{
			id  = 4,
			info = "最多问题数量",
			set = 8,
		},
	},
	learn=
	{
		[1]=
		{
			id = 1,
			ask = "推广员如何赚钱？",
			answer = {"推广员享有以下三种奖励权限，分别独立，奖金可","叠加享受：", "1）玩家奖：按有效好友人数计算奖金，最高享受邀","请20人以上5元/人的奖励；","2）比赛奖：好友首次参加千元赛并取得任意名次，","奖励您2元/人；","3）礼包奖：好友购买全返礼包，奖励您30元；好友",",购买金猪礼包Ⅰ，奖励您50元；","好友购买金猪礼包Ⅱ，奖励您50元。"},
		},
		[2]=
		{
			id = 2,
			ask = "如何成为推广员？",
			answer = {"成为推广员首先需联系鲸小哥（微信JY400888）开通","推广权限：","玩家奖权限：全服默认开通，好友满10人时联系鲸小","哥升级到高级权限，并领取66666鲸币的福利；","比赛奖权限：提供游戏ID给鲸小哥免费开通；","礼包奖权限：在【全返礼包】页面购买任意礼包后截","图给鲸小哥开通。"},
		},
		[3]=
		{
			id = 3,
			ask = "在哪里可查看详细推广奖励规则？",
			answer = {"在推广系统【如何赚钱】页面中可查看详细推广奖励","规则。",},
		},
		[4]=
		{
			id = 4,
			ask = "如何邀请好友？",
			answer = {"从游戏中分享链接或二维码到微信，微信好友通过您","分享的链接或图片下载游戏将绑定为您的下级。",},
		},
		[5]=
		{
			id = 5,
			ask = "什么是有效好友？",
			answer = {"有效好友定义：好友需完成新人福卡第2天的任务。",},
		},
		[6]=
		{
			id = 6,
			ask = "如何查看自己邀请的好友？",
			answer = {"1）在推广系统【我的收益】页面可查看好友列表；","2）关注公众号“鲸鱼新家园（微信号jyddz16888）","每次邀请成功后您都将收到公众号的信息推送。"},
		},
		[7]=
		{
			id = 7,
			ask = "如何查看并提取自己的推广收益？",
			answer = {"在推广系统【我的收益】页面可查看自己的推广收益，","推广收益每日可提取1次，每次10元起提，最高可提200","元。",},
		},
		[8]=
		{
			id = 8,
			ask = "游戏中获得的福卡有什么用处？",
			answer = {"福卡可在兑换商城中充话费、兑换实物奖品（全场","包邮）、换京东卡等，还可在充值商城兑换鲸币进行游","戏。",},
		},
	},
}