return
{
    JD = [[
        <color=#ED8813FF><size=36>1.斗地主是多少人的游戏？有多少张牌呢？</size></color>
        <color=#B98109FF>斗地主需要3名玩家；游戏使用一副标准的扑克牌，共54张</color>

        <color=#ED8813FF><size=36>2.斗地主的规则是什么呢？</size></color>
        <color=#B98109FF>发牌：系统随机一张牌为地主牌，然后依次给每个玩家发17张牌，剩余3张牌作为底牌
        叫分：由拿到地主牌的玩家开始叫分，叫3分直接成为地主，获得底牌；
        如果没有玩家叫3分，则叫分最高的玩家获得底牌；如果所有玩家都不叫地主，则重新洗牌发牌
        加倍/不加倍：叫分完毕后，玩家可以选择加倍或不加倍，加倍后，输赢翻倍</color>

        <color=#ED8813FF><size=36>3.斗地主怎么才算获胜呢？</size></color>
        <color=#B98109FF>斗地主分为地主和农民，叫分最高的玩家为地主，
        另外两名玩家为农民，游戏中先出完牌的一方获胜</color>

        <color=#ED8813FF><size=36>4.出牌规则是什么呢？</size></color>
        <color=#B98109FF>王炸>炸弹>其他牌型
        除炸弹外，其他牌型必须要牌型和总张数相同才能比较大小
        顺子按照最大的一张牌的牌点来比较大小
        飞机带翅膀和四带二按照三张和四张部分比较，带的牌不影响大小
        单牌：大王>小王>2>A>K>Q>J>10>9>8>7>6>5>4>3</color>
        ]],
    TF = [[
        <color=#ED8813FF><size=36>1.斗地主是多少人的游戏？有多少张牌呢？</size></color>
        <color=#B98109FF>斗地主需要3名玩家；游戏使用一副标准的扑克牌，共54张</color>

        <color=#ED8813FF><size=36>2.川渝斗地主的规则是什么呢？</size></color>
        <color=#B98109FF>发牌：系统随机一张牌为地主牌，然后依次给每个玩家发17张牌，剩余3张牌作为底牌
        叫地主：由拿到地主牌的玩家开始叫地主，可以闷抓或者看牌抓直接成为地主，获得底牌；
        如果前两名玩家不叫地主，尾家必须闷抓地主；
        倒/拉：地主确定后，玩家可以选择加倍或不加倍，加倍后，输赢翻倍；
        看牌：若手中有火箭（双王）或者4个2或者三个主牌均必抓，当地主；
        反之没有满足条件的主牌可自由选择是否当地主，不当地主则由下一家做出选择。
        </color>

        <color=#ED8813FF><size=36>3.斗地主怎么才算获胜呢？</size></color>
        <color=#B98109FF>斗地主分为地主和农民，叫分最高的玩家为地主，
        另外两名玩家为农民，游戏中先出完牌的一方获胜</color>

        <color=#ED8813FF><size=36>4.出牌规则是什么呢？</size></color>
        <color=#B98109FF>王炸>炸弹>其他牌型
        除炸弹外，其他牌型必须要牌型和总张数相同才能比较大小
        顺子按照最大的一张牌的牌点来比较大小
        飞机带翅膀和四带二按照三张和四张部分比较，带的牌不影响大小
		不能出三带二。除非只剩三张牌，也不能出三不带。
        单牌：大王>小王>2>A>K>Q>J>10>9>8>7>6>5>4>3</color>
    ]],
    LZ = [[
        <color=#ED8813FF><size=36>1.斗地主是多少人的游戏？有多少张牌呢？</size></color>
        <color=#B98109FF>斗地主需要3名玩家；游戏使用一副标准的扑克牌，共54张</color>

        <color=#ED8813FF><size=36>2.癞子的规则是什么呢？</size></color>
        <color=#B98109FF>发牌：系统随机一张牌为地主牌，然后依次给每个玩家发17张牌，剩余3张牌作为底牌
        叫分：由拿到地主牌的玩家开始叫分，叫3分直接成为地主，获得底牌；
        如果没有玩家叫3分，则叫分最高的玩家获得底牌；如果所有玩家都不叫地主，则重新洗牌发牌
        加倍/不加倍：叫分完毕后，玩家可以选择加倍或不加倍，加倍后，输赢翻倍</color>

        <color=#ED8813FF><size=36>3.斗地主怎么才算获胜呢？</size></color>
        <color=#B98109FF>斗地主分为地主和农民，叫分最高的玩家为地主，
        另外两名玩家为农民，游戏中先出完牌的一方获胜</color>

        <color=#ED8813FF><size=36>4.出牌规则是什么呢？</size></color>
        <color=#B98109FF>癞子牌：在加倍完毕后，系统随机一个点数为癞子牌（大小王不会成为癞子牌），
        该牌可以作为除大小王以外的任意一张牌使用，并且也可以作为原点数使用
        王炸>炸弹>其他牌型
        除炸弹外，其他牌型必须要牌型和总张数相同才能比较大小
        顺子按照最大的一张牌的牌点来比较大小
        飞机带翅膀和四带二按照三张和四张部分比较，带的牌不影响大小
        单牌：大王>小王>2>A>K>Q>J>10>9>8>7>6>5>4>3</color>
    ]],
    TY = [[
        <color=#ED8813FF><size=36>1.斗地主是多少人的游戏？有多少张牌呢？</size></color>
        <color=#B98109FF>斗地主需要3名玩家；游戏使用一副标准的扑克牌加上一张听用牌，共55张</color>

        <color=#ED8813FF><size=36>2.听用的规则是什么呢？</size></color>
        <color=#B98109FF>发牌：系统随机一张牌为地主牌，然后依次给每个玩家发17张牌，剩余4张牌作为底牌
        叫分：由拿到地主牌的玩家开始叫分，叫3分直接成为地主，获得底牌；
        如果没有玩家叫3分，则叫分最高的玩家获得底牌；如果所有玩家都不叫地主，则重新洗牌发牌
        加倍/不加倍：叫分完毕后，玩家可以选择加倍或不加倍，加倍后，输赢翻倍</color>

        <color=#ED8813FF><size=36>3.斗地主怎么才算获胜呢？</size></color>
        <color=#B98109FF>斗地主分为地主和农民，叫分最高的玩家为地主，
        另外两名玩家为农民，游戏中先出完牌的一方获胜</color>

        <color=#ED8813FF><size=36>4.出牌规则是什么呢？</size></color>
        <color=#B98109FF>听用牌可以作为任意一张牌使用，但是不可单独打出
        超级火箭>火箭>王炸>炸弹>其他牌型
        除炸弹外，其他牌型必须要牌型和总张数相同才能比较大小
        顺子按照最大的一张牌的牌点来比较大小
        飞机带翅膀和四带二按照三张和四张部分比较，带的牌不影响大小
        单牌：大王>小王>2>A>K>Q>J>10>9>8>7>6>5>4>3</color>
    ]],
    ER = [[
        <color=#ED8813FF><size=36>1.二人斗地主是多少人的游戏？有多少张牌呢？</size></color>
        <color=#B98109FF>二人斗地主由两人进行，牌库去掉3、4，每人发17张牌，留3张底牌，9张作废牌。</color>

        <color=#ED8813FF><size=36>2.二人斗地主的规则是什么呢？</size></color>
        <color=#B98109FF>发牌后，双方抢叫地主，每次抢地主都会增大底分倍数，最多来回抢4次。叫地主默认让农民1张牌，每抢一次牌让牌数+1，最多让5张牌。如让5张时，农民出到手牌≤5，即为胜利。</color>

        <color=#ED8813FF><size=36>3.斗地主怎么才算获胜呢？</size></color>
        <color=#B98109FF>农民地主各自为战，地主出完牌或农民出到≤让牌张数，即为胜利方。</color>

        <color=#ED8813FF><size=36>4.出牌规则是什么呢？</size></color>
        <color=#B98109FF>王炸>炸弹>其他牌型
        除炸弹外，其他牌型必须要牌型和总张数相同才能比较大小
        顺子按照最大的一张牌的牌点来比较大小
        飞机带翅膀和四带二按照三张和四张部分比较，带的牌不影响大小
        单牌：大王>小王>2>A>K>Q>J>10>9>8>7>6>5</color>
    ]],	
	PDK = [[
		<color=#ED8813FF><size=36>1.跑得快是多少人的游戏？有多少张牌呢？</size></color>
		<color=#B98109FF>跑得快需要3名玩家；牌库去掉大小王、三个2（留下黑桃2）和一个A（去掉黑桃A），剩余共计48张牌。平均每人分16张。</color>

        <color=#ED8813FF><size=36>2.跑得快的规则是什么呢？</size></color>
        <color=#B98109FF>1.摸到黑桃3的玩家先出牌，逆时针方向进行，先出完者获胜。
		2.手中的牌可以管上时，必须打出，即有大必出。
		3.使用炸弹获得牌权后，立刻赢得另两人各5倍底分的奖励。</color>
        
        <color=#ED8813FF><size=36>3.跑得快怎么才算获胜呢？</size></color>
        <color=#B98109FF>三名玩家各自为战，先出完牌的一方获胜</color>

        <color=#ED8813FF><size=36>4.出牌规则是什么呢？</size></color>
        <color=#B98109FF>炸弹>其他牌型
        除炸弹外，其他牌型必须要牌型和总张数相同才能比较大小
        顺子按照最大的一张牌的牌点来比较大小
        飞机和四带按照三张和四张部分比较，带的牌不影响大小
        单牌：2>A>K>Q>J>10>9>8>7>6>5>4>3</color>
    ]],	
}
