return
{
    Red = "<color=#B98109FF><size=36>1、只有在匹配场里完成一定数量的对局才可领取福卡。\n2、每个场次最多有<color=#F37E14FF><size=40>5</size></color>个星星作为进度，满星后可在该场次的结算界面领取对局福卡，次日的<color=#F37E14FF><size=40>6：00</size></color>重置进度。\n3、越高级的场次，对局福卡的数额也越大。\n4、每日领取的对局福卡最高上限为<color=#F37E14FF><size=40>5元</size></color>，次日的<color=#F37E14FF><size=40>6：00</size></color>重置。</size></color>",
    Money = "<color=#B98109FF><size=36>1、每周一的<color=#F37E14FF><size=40>6：00</size></color>到下周一的<color=#F37E14FF><size=40>6：00</size></color>，所有人在匹配场对局都会额外产生现金并放入现金奖池里。\n2、对局次数越多，奖池奖金也越多，越高级的匹配场对局更能产生大量的奖金。\n3、当自己完成一定局数的目标后可以从本周的奖池中瓜分1注奖金，完成的局数越多，瓜分的也越多。\n4、周一的<color=#F37E14FF><size=40>6：00</size></color>可领取上周一到本周一的奖池奖金，已有注的玩家可以点击奖池按钮领取现金。\n5、领取的现金存放在钱包里，在钱包里可直接将现金充值到您的微信钱包内。</size></color>",
}
