return {
	question=
	{
		[1]=
		{
			id = 1,
			ask = "全返礼包Ⅰ的价格是多少？",
			answer = 1,
			option = {"6元","7元","8元","9元"},
		},
		[2]=
		{
			id = 2,
			ask = "全返礼包Ⅰ共返多少现金？",
			answer = 4,
			option = {"4元","5元","6元","7元"},
		},
		[3]=
		{
			id = 3,
			ask = "全返礼包Ⅱ的价格是多少？",
			answer = 3,
			option = {"66元","88元","99元","199元"},
		},
		[4]=
		{
			id = 4,
			ask = "全返礼包Ⅱ如何获得100元现金？",
			answer = 2,
			option = {"玩斗地主","打比赛","玩捕鱼","玩消消乐"},
		},
		[5]=
		{
			id = 5,
			ask = "全返礼包Ⅱ打完1场千元赛后可领多少现金？",
			answer = 3,
			option = {"6元","8元","10元","12元"},
		},
		[6]=
		{
			id = 6,
			ask = "每个全返礼包的详情介绍在礼包的什么位置？",
			answer = 3,
			option = {"左上角","左下角","右上角","右下角"},
		},
	},
}